---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalAdjacentSpace
source: html/852e1517-179e-0112-4c50-7c665b2feca1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalAdjacentSpace Property

"Adjacent Analytical Space"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalAdjacentSpace { get; }
```